#include <iostream>//бібліотека вводу та виводу 
#define SIZE 3//Визначає символічну константу зі значенням 3 
using namespace std;//Використовуєво простір імен  std

int main() {

    int numbers[SIZE];//оголошення масиву розміром 4

    cout << "Enter 3 numbers: ";//Виведення повідомлення
    cin >> numbers[0]; //Заповнення користувачем першого значення масиву
    cin >> numbers[1];//Заповнення користувачем другого значення масиву
    cin >> numbers[2];//Заповнення користувачем третього значення масиву


    int minValue = numbers[0];//задаємо змінну та прирівнюємо до першого значення масиву

    for (int i = 1; i < SIZE; ++i) {// Цикл для пошуку найменшого числа введеного масиву
        if (numbers[i] < minValue) {//Логічна умова
            minValue = numbers[i];//умова якщо виконується 
        }
    }

    cout << "Smallest number: " << minValue << endl;//вивід результату 

    return 0;//закінчення 
}